# Face Properties

---
C#Visual BasicVisual C++
Include Protected MembersInclude Inherited Members
Revit 2024 API
---
Face Properties
Face Class See Also
---
The Face type exposes the following members.
# Properties
| Name | Description |
| --- | --- |
| --- | --- | --- |
| Area | The area of this face. |
| EdgeLoops | A collection of edge loops. Each edge loop represents one of the closed boundaries of the face. |
| GraphicsStyleId | The ElementId of the GeometryObject's GraphicsStyle (Inherited from GeometryObject.) |
| HasRegions | Identifies if the face contains regions (which can be created, for example, by the Split Face command). |
| Id | A unique integer identifying the GeometryObject in its associated non view-specific GeometryElement. (Inherited from GeometryObject.) |
| IsCyclic | Indicates whether the underlying surface is periodic in the specified parametric direction. |
| IsElementGeometry | Indicates whether this geometry is obtained directly from an Element. (Inherited from GeometryObject.) |
| IsReadOnly | Identifies if the object is read-only or modifiable. (Inherited from APIObject.) |
| IsTwoSided | Determines if a face is two-sided (degenerate). |
| MaterialElementId | The element ID of the material from which this face is composed. |
| OrientationMatchesSurfaceOrientation | Returns true if this face's orientation matches the orientation of the face's surface, false if they have opposite orientations. |
| Period | The period of the underlying surface in the specified parametric direction. |
| Reference | Returns a stable reference to the face. |
| Visibility | The visibility. (Inherited from GeometryObject.) |

# See Also
Face Class
Autodesk.Revit.DB Namespace